#+title: org-ref-cite
#+options: toc:nil

#+latex: \maketitle

This repo is archived and not actively maintained. If anyone wants to take over maintenance please contact me. 

This directory contains org-ref-cite. It is a setup derived from oc-natbib.el that is more similar to what I am used to with org-ref. The features include:

1. Use bibtex-completion candidates and ivy to insert references
2. cite styles that are as consistent with oc-csl as feasible
3. flyspell should ignore cites
4. Navigation functions for moving around in cites
5. Editing functions for manipulating cites (shifting the order, sorting, deleting, copying, etc)
6. Keymap on cites to make those things (4, 5) easy
7. A hydra follow menu to do lots of useful things on a cite
8. a natbib_options keyword
9. A bibliographystyle keyword
10. Customizable print_bibliography keyword


This document on its own is not as useful as the video that shows how I used it. You can see a video of this in action here:

Version 3: https://www.youtube.com/watch?v=puZMxooyDms


These videos are from the version of this library that was oc-bibtex. They might be historically interesting.

1. Version 1: https://www.youtube.com/watch?v=4ta4J20kpmM
2. Version 2: https://www.youtube.com/watch?v=3TBYg1MZ6iY

* testing the styles

#+BEGIN_SRC emacs-lisp :results org raw
(cl-loop for (style . command) in
	 (cl-loop for (style . command) in (org-ref-cite-get-combinatorial-style-commands)
			  collect
			  (cons
			   (concat (car style)
				   (when (cdr style) (format "/%s" (cdr style))))
			   command))
	 concat
	 (format "- =[cite/%s:@rose-2019-pybliom]= (%s) [cite/%s:@rose-2019-pybliom]\n"
		 style (substring command 1) style))
#+END_SRC

#+RESULTS:
- =[cite/text:@rose-2019-pybliom]= (citet) [cite/text:@rose-2019-pybliom]
- =[cite/t:@rose-2019-pybliom]= (citet) [cite/t:@rose-2019-pybliom]
- =[cite/text/bare:@rose-2019-pybliom]= (citealt) [cite/text/bare:@rose-2019-pybliom]
- =[cite/text/b:@rose-2019-pybliom]= (citealt) [cite/text/b:@rose-2019-pybliom]
- =[cite/t/bare:@rose-2019-pybliom]= (citealt) [cite/t/bare:@rose-2019-pybliom]
- =[cite/t/b:@rose-2019-pybliom]= (citealt) [cite/t/b:@rose-2019-pybliom]
- =[cite/text/caps:@rose-2019-pybliom]= (Citet) [cite/text/caps:@rose-2019-pybliom]
- =[cite/text/c:@rose-2019-pybliom]= (Citet) [cite/text/c:@rose-2019-pybliom]
- =[cite/t/caps:@rose-2019-pybliom]= (Citet) [cite/t/caps:@rose-2019-pybliom]
- =[cite/t/c:@rose-2019-pybliom]= (Citet) [cite/t/c:@rose-2019-pybliom]
- =[cite/text/full:@rose-2019-pybliom]= (citet*) [cite/text/full:@rose-2019-pybliom]
- =[cite/text/f:@rose-2019-pybliom]= (citet*) [cite/text/f:@rose-2019-pybliom]
- =[cite/t/full:@rose-2019-pybliom]= (citet*) [cite/t/full:@rose-2019-pybliom]
- =[cite/t/f:@rose-2019-pybliom]= (citet*) [cite/t/f:@rose-2019-pybliom]
- =[cite/text/caps-full:@rose-2019-pybliom]= (Citet*) [cite/text/caps-full:@rose-2019-pybliom]
- =[cite/text/cf:@rose-2019-pybliom]= (Citet*) [cite/text/cf:@rose-2019-pybliom]
- =[cite/t/caps-full:@rose-2019-pybliom]= (Citet*) [cite/t/caps-full:@rose-2019-pybliom]
- =[cite/t/cf:@rose-2019-pybliom]= (Citet*) [cite/t/cf:@rose-2019-pybliom]
- =[cite/text/bare-caps:@rose-2019-pybliom]= (Citealt*) [cite/text/bare-caps:@rose-2019-pybliom]
- =[cite/text/bc:@rose-2019-pybliom]= (Citealt*) [cite/text/bc:@rose-2019-pybliom]
- =[cite/t/bare-caps:@rose-2019-pybliom]= (Citealt*) [cite/t/bare-caps:@rose-2019-pybliom]
- =[cite/t/bc:@rose-2019-pybliom]= (Citealt*) [cite/t/bc:@rose-2019-pybliom]
- =[cite/text/bare-full:@rose-2019-pybliom]= (citealt*) [cite/text/bare-full:@rose-2019-pybliom]
- =[cite/text/bf:@rose-2019-pybliom]= (citealt*) [cite/text/bf:@rose-2019-pybliom]
- =[cite/t/bare-full:@rose-2019-pybliom]= (citealt*) [cite/t/bare-full:@rose-2019-pybliom]
- =[cite/t/bf:@rose-2019-pybliom]= (citealt*) [cite/t/bf:@rose-2019-pybliom]
- =[cite/text/bare-full:@rose-2019-pybliom]= (Citealt*) [cite/text/bare-full:@rose-2019-pybliom]
- =[cite/text/bcf:@rose-2019-pybliom]= (Citealt*) [cite/text/bcf:@rose-2019-pybliom]
- =[cite/t/bare-full:@rose-2019-pybliom]= (Citealt*) [cite/t/bare-full:@rose-2019-pybliom]
- =[cite/t/bcf:@rose-2019-pybliom]= (Citealt*) [cite/t/bcf:@rose-2019-pybliom]
- =[cite/author:@rose-2019-pybliom]= (citeauthor) [cite/author:@rose-2019-pybliom]
- =[cite/a:@rose-2019-pybliom]= (citeauthor) [cite/a:@rose-2019-pybliom]
- =[cite/author/caps:@rose-2019-pybliom]= (Citeauthor) [cite/author/caps:@rose-2019-pybliom]
- =[cite/author/c:@rose-2019-pybliom]= (Citeauthor) [cite/author/c:@rose-2019-pybliom]
- =[cite/a/caps:@rose-2019-pybliom]= (Citeauthor) [cite/a/caps:@rose-2019-pybliom]
- =[cite/a/c:@rose-2019-pybliom]= (Citeauthor) [cite/a/c:@rose-2019-pybliom]
- =[cite/author/full:@rose-2019-pybliom]= (citeauthor*) [cite/author/full:@rose-2019-pybliom]
- =[cite/author/f:@rose-2019-pybliom]= (citeauthor*) [cite/author/f:@rose-2019-pybliom]
- =[cite/a/full:@rose-2019-pybliom]= (citeauthor*) [cite/a/full:@rose-2019-pybliom]
- =[cite/a/f:@rose-2019-pybliom]= (citeauthor*) [cite/a/f:@rose-2019-pybliom]
- =[cite/author/caps-full:@rose-2019-pybliom]= (Citeauthor*) [cite/author/caps-full:@rose-2019-pybliom]
- =[cite/author/cf:@rose-2019-pybliom]= (Citeauthor*) [cite/author/cf:@rose-2019-pybliom]
- =[cite/a/caps-full:@rose-2019-pybliom]= (Citeauthor*) [cite/a/caps-full:@rose-2019-pybliom]
- =[cite/a/cf:@rose-2019-pybliom]= (Citeauthor*) [cite/a/cf:@rose-2019-pybliom]
- =[cite/noauthor:@rose-2019-pybliom]= (citeyearpar) [cite/noauthor:@rose-2019-pybliom]
- =[cite/na:@rose-2019-pybliom]= (citeyearpar) [cite/na:@rose-2019-pybliom]
- =[cite/noauthor/bare:@rose-2019-pybliom]= (citeyear) [cite/noauthor/bare:@rose-2019-pybliom]
- =[cite/noauthor/b:@rose-2019-pybliom]= (citeyear) [cite/noauthor/b:@rose-2019-pybliom]
- =[cite/na/bare:@rose-2019-pybliom]= (citeyear) [cite/na/bare:@rose-2019-pybliom]
- =[cite/na/b:@rose-2019-pybliom]= (citeyear) [cite/na/b:@rose-2019-pybliom]
- =[cite/nocite:@rose-2019-pybliom]= (nocite) [cite/nocite:@rose-2019-pybliom]
- =[cite/p:@rose-2019-pybliom]= (citep) [cite/p:@rose-2019-pybliom]
- =[cite/p/bare:@rose-2019-pybliom]= (citealp) [cite/p/bare:@rose-2019-pybliom]
- =[cite/p/b:@rose-2019-pybliom]= (citealp) [cite/p/b:@rose-2019-pybliom]
- =[cite/p/caps:@rose-2019-pybliom]= (Citep) [cite/p/caps:@rose-2019-pybliom]
- =[cite/p/c:@rose-2019-pybliom]= (Citep) [cite/p/c:@rose-2019-pybliom]
- =[cite/p/full:@rose-2019-pybliom]= (citep*) [cite/p/full:@rose-2019-pybliom]
- =[cite/p/f:@rose-2019-pybliom]= (citep*) [cite/p/f:@rose-2019-pybliom]
- =[cite/p/bare-caps:@rose-2019-pybliom]= (Citealp) [cite/p/bare-caps:@rose-2019-pybliom]
- =[cite/p/bc:@rose-2019-pybliom]= (Citealp) [cite/p/bc:@rose-2019-pybliom]
- =[cite/p/bare-full:@rose-2019-pybliom]= (citealp*) [cite/p/bare-full:@rose-2019-pybliom]
- =[cite/p/bf:@rose-2019-pybliom]= (citealp*) [cite/p/bf:@rose-2019-pybliom]
- =[cite/p/bare-caps-full:@rose-2019-pybliom]= (Citealp*) [cite/p/bare-caps-full:@rose-2019-pybliom]
- =[cite/p/bcf:@rose-2019-pybliom]= (Citealp*) [cite/p/bcf:@rose-2019-pybliom]
- =[cite/num:@rose-2019-pybliom]= (citenum) [cite/num:@rose-2019-pybliom]



** Modifying the activation of citations

The activation of citations in org-ref-cite is done by a list of function defined in =org-ref-cite-activation-functions=. You can modify this list as you see fit in your init files.

#+BEGIN_SRC emacs-lisp
org-ref-cite-activation-functions
#+END_SRC

#+RESULTS:
| org-cite-basic-activate | org-ref-cite-activate-keymap | org-ref-cite-activate-style-fontification | org-ref-cite-activate-prefix-suffix |

* Sandbox notes                                                    :noexport:

#+BEGIN_SRC emacs-lisp
(org-cite-supported-styles '(org-ref-cite))
#+END_SRC

#+RESULTS:
| (nil)         |          |          |                |                |                |                      |
| (num)         |          |          |                |                |                |                      |
| (p)           | (bare b) | (caps c) | (full f)       | (bare-caps bc) | (bare-full bf) | (bare-caps-full bcf) |
| (nocite)      |          |          |                |                |                |                      |
| (noauthor na) | (bare b) |          |                |                |                |                      |
| (author a)    | (caps c) | (full f) | (caps-full cf) |                |                |                      |
| (text t)      | (bare b) | (caps c) | (full f)       | (caps-full cf) | (bare-caps bc) | (bare-full bf bcf)   |

#+BEGIN_SRC emacs-lisp
(defun test-select-style ()
  "Select a style with completion."
  (interactive)
  (let ((candidates (cl-loop for (style . command) in (org-ref-cite-get-combinatorial-style-commands)
			     collect
			     (concat (car style)
				     (when (cdr style) (format "/%s" (cdr style)))))))
    (completing-read "Style: " candidates)))
#+END_SRC
